https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [8]:
df.apply(np.sqrt)

   A  B
0  4  9
1  4  9
2  4  9

In [9]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [10]:
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [11]:
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

In [12]:
df.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [13]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [14]:
df.apply(lambda x: [1, 2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [15]:
df

   A  B
0  4  9
1  4  9
2  4  9

In [16]:
df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2

In [17]:
df.apply(lambda x: [1, 2], axis=1, result_type='broadcast')

   A  B
0  1  2
1  1  2
2  1  2

https://www.w3resource.com/pandas/series/series-apply.php

In [18]:
s = pd.Series([31, 27, 11],
              index=['Beijing', 'Los Angeles', 'Berlin'])
s

Beijing        31
Los Angeles    27
Berlin         11
dtype: int64

In [19]:
def square(x):
    return x ** 2

In [20]:
s.apply(square)

Beijing        961
Los Angeles    729
Berlin         121
dtype: int64

In [21]:
s.apply(lambda x: x ** 2)

Beijing        961
Los Angeles    729
Berlin         121
dtype: int64

In [22]:
def subtract_custom_value(x, custom_value):
    return x - custom_value

In [23]:
s.apply(subtract_custom_value, args=(4,))

Beijing        27
Los Angeles    23
Berlin          7
dtype: int64

https://www.analyticsvidhya.com/blog/2020/03/what-are-lambda-functions-in-python/

In [24]:
df=pd.DataFrame({
    'id':[1,2,3,4,5],
    'name':['Jeremy','Frank','Janet','Ryan','Mary'],
    'age':[20,25,15,10,30],
    'income':[4000,7000,200,0,10000]
})
df

   id    name  age  income
0   1  Jeremy   20    4000
1   2   Frank   25    7000
2   3   Janet   15     200
3   4    Ryan   10       0
4   5    Mary   30   10000

In [25]:
df['age']=df.apply(lambda x: x['age']+3,axis=1)
df

   id    name  age  income
0   1  Jeremy   23    4000
1   2   Frank   28    7000
2   3   Janet   18     200
3   4    Ryan   13       0
4   5    Mary   33   10000

In [26]:
df['age']=df['age'].apply(lambda x: x+3)
df

   id    name  age  income
0   1  Jeremy   26    4000
1   2   Frank   31    7000
2   3   Janet   21     200
3   4    Ryan   16       0
4   5    Mary   36   10000

Apply function to every row in a Pandas DataFrame

https://www.geeksforgeeks.org/apply-function-to-every-row-in-a-pandas-dataframe/

In [32]:
# Import pandas package
import pandas as pd
 
# Function to add
def add(a, b, c):
    return a + b + c
 

data = {'A':[1, 2, 3],
        'B':[4, 5, 6],
        'C':[7, 8, 9] }

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

df['add'] = df.apply(lambda row : add(row['A'],
                 row['B'], row['C']), axis = 1)


print('\nAfter Applying Function: ')
# printing the new dataframe
print(df)

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After Applying Function:
   A  B  C  add
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18

In [33]:
data = {
        'A':[1, 2, 3],
        'B':[4, 5, 6],
        'C':[7, 8, 9] }

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)
 
df['add'] = df.apply(np.sum, axis = 1)

print('\nAfter Applying Function: ')
# printing the new dataframe
print(df)

Original DataFrame:
    A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

After Applying Function:
   A  B  C  add
0  1  4  7   12
1  2  5  8   15
2  3  6  9   18